<script setup lang='ts'>
  import PaddedPage from '@/components/ui/padded-page.vue';

  export type ITeamMember = {
    fullName: string,
    profession: string,
    imageSrc?: string
  }

</script>

<template>
  <PaddedPage>
    <h1>Треки</h1>
    <div :class='$style.track'>
      <h2>Группа Крысы — Чугун</h2>
      <div>
        В жарком, как жерло вулкана в адском цеху.<br/>
        Капли металла и пота смешались на лбу.<br/>
        Скрежет цепей под силой мозолистых рук.<br/>
        Я не конторная крыса, ебашу чугун.<br/><br/>

        Руби хой!<br/>
        Дави хой, хой!<br/>
        Тяни хой!<br/>
        Шатай хой!<br/>
        Долби хой, хой!<br/>
        Ори хой!<br/><br/>

        Грохот железных труб, едкий дым вокруг.<br/>
        Профиль двутавра погнут, в спину щелкает кнут.<br/><br/>

        Руби хой!<br/>
        Дави хой, хой!<br/>
        Тяни хой!<br/>
        Шатай хой!<br/>
        Долби хой, хой!<br/>
        Ори хой!<br/>
      </div>
    </div>

    <div :class='$style.track'>
      <h2>Пулярес — Brooklyn American Ale</h2>
      <div>
        Дым от пепла на столу,<br/>
        ты танцуешь на полу.<br/>
        Тело трется по шесту.<br/>
        Ох, так больше не могу.<br/><br/>

        Сотри мне пот на лбу<br/>
        я в твои глаза смотрю.<br/>
        Тело трется по шесту.<br/>
        Я так больше не могу.<br/><br/>

        После того как закончишь работать,<br/>
        я подожду тебя у входа,<br/>
        и мы поедем на мое поле.<br/>
        Ты всегда хотела ковбоя,<br/>
        мы будем курить, валяться на сене,<br/>
        смотреть друг на друга,<br/>
        мне нравится это.<br/>
        Когда ты умрешь,<br/>
        ты будешь на небе.<br/>
        Когда я умру, я буду один.<br/>
        Я буду один, так сложатся карты,<br/>
        и все, что было, больше не будет,<br/>
        больше не будет, больше не будет.<br/><br/>

        Когда я умру, я буду один.<br/>
        Когда я умру, я буду один.<br/>
        Когда я умру, я буду один,<br/>
        один, один, один, один.<br/><br/>

        Когда я умру, когда я умру,<br/>
        я буду один, один, один, один, один.<br/>
      </div>
    </div>

    <div :class='$style.track'>
      <h2>Клуб Пыли — Детка Детка</h2>
      <div>
        Психотека!<br/>
        Детка, детка, ты змея.<br/>
        У меня болит голова.<br/>
        Я сжигаю все дотла,<br/>
        ты удавка для меня.<br/><br/>

        Ты удавка для нас всех,<br/>
        вызываешь только смех.<br/>
        Неудачник, как и я.<br/>
        Детка, детка, ты змея.<br/><br/>

        Детка, детка, не спеши,<br/>
        остановись и грудью дыши.<br/>
        У меня на теле швы.<br/>
        Потеряла к сердцу ключи.<br/><br/>

        Детка, детка, не молчи.<br/>
        Детка, детка, не молчи.<br/>
        Детка, детка, не молчи.<br/>
        Детка, детка, не молчи.<br/><br/>

        Детка… детка…<br/>
        Детка… детка…<br/><br/>

        Детка, детка, как дела?<br/>
        Дым от сигарет изо рта.<br/>
        Ты так близко у окна,<br/>
        так и кинешься туда.<br/><br/>

        Детка, детка хочет крови,<br/>
        На моей груди паук.<br/>
        Я пройду километры боли<br/>
        к разведенному мосту.<br/><br/>

        Детка, детка, тебя отведу.<br/>
        Я на кладбище живу,<br/>
        на тебя еще взгляну,<br/>
        детка, детка, и уйду.<br/><br/>

        Детка, детка, уууу.<br/>
        Детка, детка, уууу.<br/>
        Детка, детка, у у у.<br/>
        Детка, детка, уууу.<br/>
      </div>
    </div>

    <div :class='$style.track'>
      <h2>Фьюрио — Спички</h2>
      <div>
        Мне никогда не станет понятно,<br/>
        почему я вижу это опять.<br/>
        Каждый сон повторяется дважды,<br/>
        каждый раз я хочу убежать.<br/><br/>

        Вечером в электричке<br/>
        я зажигаю в тамбуре спички.<br/>
        Когда последняя затухает,<br/>
        ты меня на перроне встречаешь.<br/><br/>

        На улице перевернулась машина,<br/>
        в осколках стекла отражаются лица.<br/>
        И ты снимаешь меня на память,<br/>
        и ты снимаешь меня на память.<br/><br/>

        Молнию куртки снова заело,<br/>
        тревога сменяется осенним сном.<br/>
        Сегодня посмотрим на кроны деревьев,<br/>
        я чувствую холод земли под собой.<br/><br/>

        Вечером в электричке<br/>
        я зажигаю в тамбуре спички.<br/>
        Когда последняя затухает,<br/>
        ты меня на перроне встречаешь.<br/><br/>

        На улице перевернулась машина,<br/>
        в осколках стекла отражаются лица.<br/>
        И ты снимаешь меня на память,<br/>
        и ты снимаешь меня на память.<br/><br/>
      </div>
    </div>

    <div :class='$style.track'>
      <h2>Para Cuntuzi — Plastique Tube</h2>
      <div>
        Ты!<br/>>
        острый соус к жареной курице,<br/>
        единственный фонарь на моей улице,<br/>
        в школьной тетради запись ‘умница!’,<br/>
        литая наковальня в горячей кузнице,<br/>
<br/>
        тяжелый поршень в гидравлическом прессе,<br/>
        прописанные таблетки при сильном стрессе,<br/>
        победитель поединка в суперлегком весе,<br/>
        главная роль в драматической пьесе,<br/>
<br/>
        ваза с цветами в хрустальном сервизе,<br/>
        позитивное решение по финской визе,<br/>
        тропический муссон на морском круизе,<br/>
        полуголый силуэт на акварельном эскизе,<br/>
<br/>
        кресло напротив в салоне экспресса,<br/>
        на блестящем капоте значок мерседеса,<br/>
        под палящим солнцем глоток дюшеса,<br/>
        ответ на вопрос о моих интересах.<br/>
<br/>
        Ты!<br/>
        сломанный знак на скоростном автобане,<br/>
        мыльная вода в керамической ванне,<br/>
        фантик от жвачки в заднем кармане,<br/>
        пластиковая трубочка в стеклянном стакане,<br/>
<br/>
        грязная футболка в корзине для стирки,<br/>
        фатальная ошибка в листе копирки,<br/>
        сетка апельсинов с оторванной биркой,<br/>
        чёрный носок с заштопанной дыркой,<br/>
<br/>
        пульсирующий круг уходящей геометки,<br/>
        дрожащий лист на засохшей ветке,<br/>
        грустный смайлик в тетрадной клетке,<br/>
        «не утилизировать» на этикетке,<br/>
<br/>
        зажатые уши из-за сильного шума,<br/>
        надкусанный кубик рахат-лукума,<br/>
        пыльный рейл стритвир шоурума,<br/>
        нерешенное уравнение на тему «сумма».<br/>
      </div>
    </div>

    <div :class='$style.track'>
      <h2>Группы Крысы — Мой Волк</h2>
      <div>
        Старый серый волк<br/>
        под дождем промок.<br/>
        Воет на луну,<br/>
        волк уходит в тьму.<br/>
<br/>
        И ему не страшны ловушки,<br/>
        и ему не страшен темный лес.<br/>
        Его жизнь - это не игрушки,<br/>
        на луну по ночам он воет.<br/>
<br/>
        Мой волк воет на луну у-у-у-у.<br/>
        Мой волк воет в тишину,<br/>
        и в ответ ему<br/>
        раздается только у-уу-у-у-у.<br/>
<br/>
        Мой волк бежал по скалам,<br/>
        мой волк искал еду.<br/>
        Мой волк с блестящим оскалом,<br/>
        мой волк убил овцу.<br/>
<br/>
        Мой волк никого не жалеет,<br/>
        мой волк никого не любил.<br/>
        Мой волк, он один, одиночка.<br/>
        Мой волк — это я или ты.<br/>
      </div>
    </div>

    <div :class='$style.track'>
      <h2>Клуб Пыли — Неудачник</h2>
      <div>
        Я неудачник!<br/>
        так же, как и ты,<br/>
        так же, как и ты,<br/>
        ты, ты, ты, ты.<br/>
<br/>
        Я неудачник!<br/>
        так же, как и ты,<br/>
        так же, как и ты,<br/>
        ты, ты, ты, ты, ты.<br/>
<br/>
        Это мир постправды,<br/>
        и правда у всех своя.<br/>
        Но разве так<br/>
        не было всегда?<br/>
<br/>
        Кто обманет, кто соврет,<br/>
        кто за нос тебя проведет.<br/>
        Но мне все равно,<br/>
        я просто обычный гот.<br/>
<br/>
        Я неудачник!<br/>
        так же, как и ты,<br/>
        так же, как и ты,<br/>
        ты, ты, ты, ты.<br/>
<br/>
        Я неудачник!<br/>
        так же, как и ты,<br/>
        так же, как и ты,<br/>
        ты, ты, ты, ты, ты.<br/>
<br/>
        Неудачник, неудачник,<br/>
        неудачник, неудачник,<br/>
        неудачник, неудачник,<br/>
        неудачник, неудачник,<br/>
        неудачник, неудачник,<br/>
        неудачник, неудачник,<br/>
        неудачник, неудачник,<br/>
        неудачник!<br/>
<br/>
        И когда над домом надвисает чужой флаг,<br/>
        хочется сказать, что все сложилось не так.<br/>
        И когда я тоже слышу, что кто-то перверт,<br/>
        я сразу понимаю, что речь обо мне.<br/>
<br/>
        Я такой неудачник,<br/>
        но это ничто не значит,<br/>
        не значит для меня.<br/>
<br/>
        Я такой неудачник,<br/>
        так же, как и все,<br/>
        так же, как и …<br/>
<br/>
        Я неудачник!<br/>
        так же, как и ты,<br/>
        так же, как и ты,<br/>
        ты, ты, ты, ты.<br/>
<br/>
        Я неудачник!<br/>
        так же, как и ты,<br/>
        так же, как и ты,<br/>
        ты, ты, ты, ты, ты.<br/>
      </div>
    </div>

    <div :class='$style.track'>
      <h2>Фьюрио — Soft Porn</h2>
      <div>
        Ты зовешь меня в гости<br />
        типа глянуть кино,<br />
        но я знаю что это обманка.<br />
<br />
        Ты трясёшься от злости,<br />
        если споришь со мной,<br />
        говоришь что я хулиганка.<br />
<br />
        Ты приносишь напитки,<br />
        карамельный попкорн,<br />
        предлагаешь послушать рэп треки.<br />
<br />
        Перебрал все новинки<br />
        и включаешь софтпорн —<br />
        бриллиант твоей фильмотеки.<br />
<br />
        Хочу уехать, хочу убежать!<br />
        Аааа<br />
        Я не хочу с тобой зависать<br />
        Аааа<br />
        В душной квартире на Караванной,<br />
        хочу сидеть дома, смотреть “Клан Сопрано”.<br />
        Аааааа<br />
        Аааааа<br />
<br />
        Звук на полную громкость,<br />
        когда дома нет мамы —<br />
        ей сегодня в ночную смену.<br />
<br />
        Заколачивай гвозди<br />
        под картинную раму,<br />
        пока смотрим первую сцену.<br />
<br />
        Мы лежим на диване<br />
        стиля супер хай тек,<br />
        я в короткой футболке, ты в худи.<br />
<br />
        на огромном экране<br />
        60 дюймов High Def<br />
        смотрим как раздеваются люди.<br />
<br />
        Хочу уехать, хочу убежать!<br />
        Аааа<br />
        Я не хочу с тобой зависать!<br />
        Аааа<br />
<br />
        Ты садишься все ближе,<br />
        и становится тесно<br />
        нам и голой экранной паре.<br />
<br />
        Фильм подходит к развязке,<br />
        мне так неинтересно,<br />
        хоть софтпорн в самом разгаре.<br />
<br />
        я хочу раствориться,<br />
        перелезть по карнизу<br />
        сползти вниз по трубе водостока.<br />
<br />
        Ты пытаешься злиться,<br />
        не готов к компромиссу,<br />
        говоришь что тебе одиноко.<br />
<br />
        Ааааа<br />
<br />
        Ааааа<br />
<br />
        Надеваю пальто,<br />
        мы обнимем друг друга,<br />
        поцелую тебя на прощание,<br />
<br />
        и в салоне такси<br />
        запишу войс подругам<br />
        что мне скучно ходить на свидания.<br />>
      </div>
    </div>


    <div :class='$style.track'>
      <h2>Клуб Пыли — Пятна на Кофте</h2>
      <div>
        Когда мне будет 30,<br/>
        я открою магазин.<br/>
        Там будут продаваться<br/>
        масло и бензин.<br/>
<br/>
        Когда мне будет 40,<br/>
        я открою аквапарк,<br/>
        буду с горки кататься<br/>
        вооот так:<br/>
<br/>
        Ууууу<br/>
<br/>
        Пятна на кофте,<br/>
        занимаешься сексом,<br/>
        смотришь в окно.<br/>
<br/>
        Ууууу<br/>
<br/>
        Я жертва-подросток,<br/>
        ты можешь убить меня —<br/>
        мне все равно.<br/>
<br/>
        Когда будет 50,<br/>
        я пойду в ТЦ<br/>
        и куплю себе шмотки<br/>
        для детей.<br/>
<br/>
        Когда будет 60,<br/>
        я накрашу ресницы<br/>
        и пойду работать<br/>
        доставщиком пиццы.<br/>
<br/>
        Ууууу<br/>
<br/>
        Пятна на кофте,<br/>
        занимаешься сексом,<br/>
        смотришь в окно.<br/>
<br/>
        Ууууу<br/>
<br/>
        Я жертва-подросток,<br/>
        ты можешь убить меня —<br/>
        мне все равно.<br/>
<br/>
        Когда 70 будет,<br/>
        я сменю себе пол,<br/>
        и сосед не узнает,<br/>
        кто она или он.<br/>
<br/>
        Когда мне будет 100,<br/>
        я запрусь в туалете,<br/>
        отключу телефону<br/>
        и поставлю укол.<br/>
<br/>
        Ууууу<br/>
<br/>
        Пятна на кофте,<br/>
        занимаешься сексом,<br/>
        смотришь в окно.<br/>
<br/>
        Ууууу<br/>
<br/>
        Я жертва-подросток,<br/>
        ты можешь убить меня —<br/>
        мне все равно.<br/>
      </div>
    </div>

    <div :class='$style.track'>
      <h2>Цейтнот — Корабли (extended)</h2>
      <div>
        Весенний луч<br/>
        зовёт во двор.<br/>
        Мой старый рейс,<br/>
        чёрный бадлон.<br/>
<br/>
        Иду один,<br/>
        не звал никто.<br/>
        И нету дел,<br/>
        дышать легко.<br/>
<br/>
        В этом городе птицы летают,<br/>
        корабли к островам прибывают.<br/>
        В этом городе рано светает,<br/>
        ночью улицы не засыпают.<br/>
<br/>
        В этом городе потеряна правда,<br/>
        в этом городе все ищут Влада.<br/>
        В этом городе так неуютно,<br/>
        и ты поймёшь.<br/>
<br/>
        Мой старый дом и юность в нем.<br/>
        Он, как никто, наполнит сон.<br/>
        Мои друзья остались там,<br/>
        и моя боль уже прошла.<br/>
<br/>
        В этом городе птицы летают,<br/>
        корабли к островам прибывают.<br/>
        В этом городе рано светает,<br/>
        ночью улицы не засыпают.<br/>
<br/>
        В этом городе потеряна правда,<br/>
        в этом городе все ищут Влада.<br/>
        В этом городе так неуютно,<br/>
        и ты поймёшь.<br/>
      </div>
    </div>

  </PaddedPage>
</template>

<style module>
  h2 {
    margin-top: 1em;
  }
  .track {
  }
</style>
